use curriculum::{Course, course};

pub fn chosen() -> Vec<String> {
    [
        "核科学概论及前沿动态",
        "学术伦理道德和科学写作",
        "文献综述与英语报告",
        "核反应堆设计原理",
        "电离辐射计量学",
        "核燃料循环1班",
        "核物理与粒子物理概论",
        "核仪器与方法",
        "核辐射探测器",
        "可编程器件及应用",
        "自然辩证法概论",
        "英语1班",
        "新时代中国特色社会主义理论与实践2班",
        "数值分析",
        "数学建模",
        "人文通识课",
    ]
    .into_iter()
    .map(Into::into)
    .collect()
}

pub fn courses() -> Vec<Course> {
    vec![
        course!(
            "高等电动力学",
            "红楼101",
            ("马海亮"),
            ((2025, 9, 1, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "粉末冶金学",
            "红楼106",
            ("向南翔"),
            ((2025, 9, 1, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "数学建模",
            "红楼二层阶梯",
            ("肖丽丽"),
            ((2025, 9, 1, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "实验核物理",
            "红楼103",
            ("寅新艺"),
            ((2025, 9, 1, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "化学反应动力学",
            "红楼101",
            ("刘丽君"),
            ((2025, 9, 1, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "电离辐射剂量学",
            "红楼309",
            ("许振华"),
            ((2025, 9, 1, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "核工程弹塑性力学",
            "红楼302",
            ("戴守通"),
            ((2025, 9, 1, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "高级计算机语言",
            "红楼二层阶梯",
            ("李永"),
            ((2025, 9, 1, 16, 30, 0), 16, 7),
            170
        ),
        course!(
            "核辐射探测器",
            "红楼309",
            ("左义"),
            ((2025, 9, 1, 16, 30, 0), 16, 7),
            170
        ),
        course!(
            "核燃料循环2班",
            "红楼101",
            ("姜小燕"),
            ((2025, 9, 1, 16, 30, 0), 12, 7),
            170
        ),
        course!(
            "数据处理与可视化实践",
            "红楼106",
            ("宋赫轩"),
            ((2025, 9, 1, 16, 30, 0), 16, 7),
            170
        ),
        course!(
            "科技英语1班",
            "红楼203",
            ("李金凤"),
            ((2025, 9, 2, 8, 0, 0), 16, 7),
            110
        ),
        course!(
            "数值分析",
            "红楼一层阶梯",
            ("肖丽丽"),
            ((2025, 9, 2, 8, 0, 0), 16, 7),
            110
        ),
        course!(
            "科技英语2班",
            "红楼203",
            ("李金凤"),
            ((2025, 9, 2, 10, 0, 0), 16, 7),
            110
        ),
        course!(
            "核物理与粒子物理概论",
            "红楼二层阶梯",
            ("寅新艺"),
            ((2025, 9, 2, 10, 0, 0), 16, 7),
            110
        ),
        course!(
            "溶剂萃取化学",
            "红楼101",
            ("刘丽君"),
            ((2025, 9, 2, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "核电子学",
            "红楼309",
            ("袁大庆"),
            ((2025, 9, 2, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "软件工程与实践",
            "红楼103",
            ("程成"),
            ((2025, 9, 2, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "高等核反应堆热工",
            "红楼302",
            ("赵民富"),
            ((2025, 9, 2, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "数学物理方法",
            "红楼二层阶梯",
            ("高早春"),
            ((2025, 9, 2, 16, 30, 0), 16, 7),
            170
        ),
        course!(
            "核化工数学模型",
            "红楼101",
            ("于婷"),
            ((2025, 9, 2, 16, 30, 0), 16, 7),
            170
        ),
        course!(
            "高等核反应堆物理",
            "红楼302",
            ("孙征"),
            ((2025, 9, 2, 16, 30, 0), 16, 7),
            170
        ),
        course!(
            "高等数理统计",
            "红楼二层阶梯",
            ("李永"),
            ((2025, 9, 3, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "核燃料循环1班",
            "红楼309",
            ("李金英"),
            ((2025, 9, 3, 8, 0, 0), 12, 7),
            230
        ),
        course!(
            "电离辐射防护",
            "红楼302",
            ("宋英明", "安海霞"),
            ((2025, 9, 3, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "高等数值分析",
            "红楼二层阶梯",
            ("王端"),
            ((2025, 9, 3, 18, 30, 0), 16, 7),
            170
        ),
        course!(
            "核化学与放射化学",
            "红楼302",
            ("寅新艺", "刘丽君"),
            ((2025, 9, 4, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "核工业中的人工智能",
            "红楼二层阶梯",
            ("卢朓", "谭思超", "陈彬"),
            ((2025, 9, 4, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "嵌入式系统设计及应用",
            "红楼101",
            ("王斌"),
            ((2025, 9, 4, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "数值分析",
            "红楼一层阶梯",
            ("肖丽丽"),
            ((2025, 9, 4, 16, 0, 0), 16, 7),
            110
        ),
        course!(
            "中子物理",
            "红楼103",
            ("阮锡超"),
            ((2025, 9, 4, 18, 30, 0), 16, 7),
            170
        ),
        course!(
            "核仪器与方法",
            "红楼101",
            ("左义"),
            ((2025, 9, 4, 18, 30, 0), 11, 7),
            170
        ),
        course!(
            "高等量子力学",
            "红楼106",
            ("高早春"),
            ((2025, 9, 4, 18, 30, 0), 16, 7),
            170
        ),
        course!(
            "电化学基础",
            "红楼106",
            ("吴继宗"),
            ((2025, 9, 5, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "加速器物理",
            "红楼101",
            ("彭朝华"),
            ((2025, 9, 5, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "高等电离辐射防护",
            "红楼302",
            ("肖雪夫"),
            ((2025, 9, 5, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "核能工程材料",
            "红楼二层阶梯",
            ("龙斌", "王辉"),
            ((2025, 9, 5, 8, 0, 0), 16, 7),
            230
        ),
        course!(
            "等离子体物理",
            "线上授课红楼203",
            ("曲洪鹏"),
            ((2025, 9, 5, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "配位化学",
            "红楼103",
            ("李济民"),
            ((2025, 9, 5, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "量子场论",
            "红楼106",
            ("张英逊"),
            ((2025, 9, 5, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "科技法语",
            "红楼101",
            ("龚禾林", "袁怡佳", "吉宏俊"),
            ((2025, 9, 5, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "高等数值分析",
            "红楼二层阶梯",
            ("王端"),
            ((2025, 9, 5, 18, 30, 0), 16, 7),
            170
        ),
        course!(
            "英语1班",
            "白楼二层阶梯",
            ("林文静"),
            ((2025, 9, 6, 8, 0, 0), 8, 7),
            ((2025, 9, 6, 10, 0, 0), 8, 7),
            110
        ),
        course!(
            "新时代中国特色社会主义理论与实践1班",
            "红楼一层阶梯",
            ("杨向鹏"),
            ((2025, 9, 6, 8, 0, 0), 8, 7),
            110
        ),
        course!(
            "新时代中国特色社会主义理论与实践1班",
            "红楼一层阶梯",
            ("杨向鹏"),
            ((2025, 11, 1, 10, 0, 0), 8, 7),
            110
        ),
        course!(
            "英语2班",
            "白楼二层阶梯",
            ("林文静"),
            ((2025, 9, 6, 10, 0, 0), 8, 7),
            ((2025, 9, 6, 8, 0, 0), 8, 7),
            110
        ),
        course!(
            "新时代中国特色社会主义理论与实践2班",
            "红楼一层阶梯",
            ("杨向鹏"),
            ((2025, 9, 6, 10, 0, 0), 8, 7),
            ((2025, 11, 1, 8, 0, 0), 8, 7),
            110
        ),
        course!(
            "凝聚态物理",
            "红楼101",
            ("李天富"),
            ((2025, 9, 6, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "测量不确定评定与表示",
            "红楼302",
            ("朱海巧"),
            ((2025, 9, 6, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "激光原理",
            "红楼106",
            ("班晓娜"),
            ((2025, 9, 6, 14, 0, 0), 16, 7),
            230
        ),
        course!(
            "核反应堆中子学实验技术",
            "红楼103",
            ("刘锋", "史永谦"),
            ((2025, 9, 6, 14, 0, 0), 16, 7),
            230
        ),
    ]
}
